package pro.sky.springExeptions.api;

import org.springframework.boot.SpringApplication;
import org.springframework.boot.autoconfigure.SpringBootApplication;

@SpringBootApplication
public class SpringRegistrationApplication {

	public static void main(String[] args) {
		SpringApplication.run(SpringRegistrationApplication.class, args);
	}
// 1. Напишите статический метод, который принимает на вход три параметра: login, password и confirmPassword.
// 2. Параметр Login содержит в себе только латинские буквы, цифры и знак подчеркивания.
//    *Например, java_skypro_go.* У параметра login есть ограничение по длине – он должен быть равен или меньше 20 символов.
//    Если login длиннее 20 символов или содержит в себе недопустимые символы, то необходимо выбросить исключение – `WrongLoginException`.
// 3. Параметр Password содержит в себе только латинские буквы, цифры и знак подчеркивания. *Например, D_1hWiKjjP_9.*
//    Если password длиннее 20 символов или содержит в себе недопустимые символы, то необходимо выбросить исключение – `WrongPasswordException`.
// 4. Параметры password и confirmPassword должны быть равны. Если это требование не соблюдается, то нужно выбросить `WrongPasswordException`.
// 5. Для обработки исключений используйте multi-catch block.
// 6. Метод ничего не должен возвращать, если значения параметров подходят под ограничения,  или бросать исключение, если условия не выполняются.
// 7. При вызове метода необходимо обработать потенциальные исключения.
//
//		- Подсказка 1
//
//	Задание можно выполнить при помощи знаний, которые вы получили на данный момент: циклы и строки.
//	Нужно задать строку/массив разрешенных символов, и, используя проверку в цикле, определить, содержит ли проверяемая строка неразрешенные символы.

//		- Подсказка 2
//	try {//Блок кода,в котором должны отслеживаться ошибки
//	}catch (тип_исключения_1 объект_исключения) {
//		//Обработка исключения тип_исключения_1// }
//
//	catch (тип_исключения_2 объект_исключения) {
//		//Обработка исключения тип_исключения_2
//	}
//	//...
//	finally
//		//блок кода,который должен быть непременно выполнен по завершении блока try
//			}
}
